# ####################################################################

#  Created by Encounter(R) RTL Compiler v08.10-s213_1 on Sun Jun 22 21:04:27 EEST 2014

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design multiplier_top

create_clock -name "clk" -add -period 5.55 -waveform {0.0 2.775} [get_ports clk]
set_dont_touch_network [get_clocks clk]
set_load -pin_load 0.1 [get_ports {result[63]}]
set_load -pin_load 0.1 [get_ports {result[62]}]
set_load -pin_load 0.1 [get_ports {result[61]}]
set_load -pin_load 0.1 [get_ports {result[60]}]
set_load -pin_load 0.1 [get_ports {result[59]}]
set_load -pin_load 0.1 [get_ports {result[58]}]
set_load -pin_load 0.1 [get_ports {result[57]}]
set_load -pin_load 0.1 [get_ports {result[56]}]
set_load -pin_load 0.1 [get_ports {result[55]}]
set_load -pin_load 0.1 [get_ports {result[54]}]
set_load -pin_load 0.1 [get_ports {result[53]}]
set_load -pin_load 0.1 [get_ports {result[52]}]
set_load -pin_load 0.1 [get_ports {result[51]}]
set_load -pin_load 0.1 [get_ports {result[50]}]
set_load -pin_load 0.1 [get_ports {result[49]}]
set_load -pin_load 0.1 [get_ports {result[48]}]
set_load -pin_load 0.1 [get_ports {result[47]}]
set_load -pin_load 0.1 [get_ports {result[46]}]
set_load -pin_load 0.1 [get_ports {result[45]}]
set_load -pin_load 0.1 [get_ports {result[44]}]
set_load -pin_load 0.1 [get_ports {result[43]}]
set_load -pin_load 0.1 [get_ports {result[42]}]
set_load -pin_load 0.1 [get_ports {result[41]}]
set_load -pin_load 0.1 [get_ports {result[40]}]
set_load -pin_load 0.1 [get_ports {result[39]}]
set_load -pin_load 0.1 [get_ports {result[38]}]
set_load -pin_load 0.1 [get_ports {result[37]}]
set_load -pin_load 0.1 [get_ports {result[36]}]
set_load -pin_load 0.1 [get_ports {result[35]}]
set_load -pin_load 0.1 [get_ports {result[34]}]
set_load -pin_load 0.1 [get_ports {result[33]}]
set_load -pin_load 0.1 [get_ports {result[32]}]
set_load -pin_load 0.1 [get_ports {result[31]}]
set_load -pin_load 0.1 [get_ports {result[30]}]
set_load -pin_load 0.1 [get_ports {result[29]}]
set_load -pin_load 0.1 [get_ports {result[28]}]
set_load -pin_load 0.1 [get_ports {result[27]}]
set_load -pin_load 0.1 [get_ports {result[26]}]
set_load -pin_load 0.1 [get_ports {result[25]}]
set_load -pin_load 0.1 [get_ports {result[24]}]
set_load -pin_load 0.1 [get_ports {result[23]}]
set_load -pin_load 0.1 [get_ports {result[22]}]
set_load -pin_load 0.1 [get_ports {result[21]}]
set_load -pin_load 0.1 [get_ports {result[20]}]
set_load -pin_load 0.1 [get_ports {result[19]}]
set_load -pin_load 0.1 [get_ports {result[18]}]
set_load -pin_load 0.1 [get_ports {result[17]}]
set_load -pin_load 0.1 [get_ports {result[16]}]
set_load -pin_load 0.1 [get_ports {result[15]}]
set_load -pin_load 0.1 [get_ports {result[14]}]
set_load -pin_load 0.1 [get_ports {result[13]}]
set_load -pin_load 0.1 [get_ports {result[12]}]
set_load -pin_load 0.1 [get_ports {result[11]}]
set_load -pin_load 0.1 [get_ports {result[10]}]
set_load -pin_load 0.1 [get_ports {result[9]}]
set_load -pin_load 0.1 [get_ports {result[8]}]
set_load -pin_load 0.1 [get_ports {result[7]}]
set_load -pin_load 0.1 [get_ports {result[6]}]
set_load -pin_load 0.1 [get_ports {result[5]}]
set_load -pin_load 0.1 [get_ports {result[4]}]
set_load -pin_load 0.1 [get_ports {result[3]}]
set_load -pin_load 0.1 [get_ports {result[2]}]
set_load -pin_load 0.1 [get_ports {result[1]}]
set_load -pin_load 0.1 [get_ports {result[0]}]
set_clock_gating_check -setup 0.0 
set_max_fanout 20.000 [current_design]
set_max_transition 1.0 [current_design]
set_max_transition 0.5 [get_ports {result[63]}]
set_max_transition 0.5 [get_ports {result[62]}]
set_max_transition 0.5 [get_ports {result[61]}]
set_max_transition 0.5 [get_ports {result[60]}]
set_max_transition 0.5 [get_ports {result[59]}]
set_max_transition 0.5 [get_ports {result[58]}]
set_max_transition 0.5 [get_ports {result[57]}]
set_max_transition 0.5 [get_ports {result[56]}]
set_max_transition 0.5 [get_ports {result[55]}]
set_max_transition 0.5 [get_ports {result[54]}]
set_max_transition 0.5 [get_ports {result[53]}]
set_max_transition 0.5 [get_ports {result[52]}]
set_max_transition 0.5 [get_ports {result[51]}]
set_max_transition 0.5 [get_ports {result[50]}]
set_max_transition 0.5 [get_ports {result[49]}]
set_max_transition 0.5 [get_ports {result[48]}]
set_max_transition 0.5 [get_ports {result[47]}]
set_max_transition 0.5 [get_ports {result[46]}]
set_max_transition 0.5 [get_ports {result[45]}]
set_max_transition 0.5 [get_ports {result[44]}]
set_max_transition 0.5 [get_ports {result[43]}]
set_max_transition 0.5 [get_ports {result[42]}]
set_max_transition 0.5 [get_ports {result[41]}]
set_max_transition 0.5 [get_ports {result[40]}]
set_max_transition 0.5 [get_ports {result[39]}]
set_max_transition 0.5 [get_ports {result[38]}]
set_max_transition 0.5 [get_ports {result[37]}]
set_max_transition 0.5 [get_ports {result[36]}]
set_max_transition 0.5 [get_ports {result[35]}]
set_max_transition 0.5 [get_ports {result[34]}]
set_max_transition 0.5 [get_ports {result[33]}]
set_max_transition 0.5 [get_ports {result[32]}]
set_max_transition 0.5 [get_ports {result[31]}]
set_max_transition 0.5 [get_ports {result[30]}]
set_max_transition 0.5 [get_ports {result[29]}]
set_max_transition 0.5 [get_ports {result[28]}]
set_max_transition 0.5 [get_ports {result[27]}]
set_max_transition 0.5 [get_ports {result[26]}]
set_max_transition 0.5 [get_ports {result[25]}]
set_max_transition 0.5 [get_ports {result[24]}]
set_max_transition 0.5 [get_ports {result[23]}]
set_max_transition 0.5 [get_ports {result[22]}]
set_max_transition 0.5 [get_ports {result[21]}]
set_max_transition 0.5 [get_ports {result[20]}]
set_max_transition 0.5 [get_ports {result[19]}]
set_max_transition 0.5 [get_ports {result[18]}]
set_max_transition 0.5 [get_ports {result[17]}]
set_max_transition 0.5 [get_ports {result[16]}]
set_max_transition 0.5 [get_ports {result[15]}]
set_max_transition 0.5 [get_ports {result[14]}]
set_max_transition 0.5 [get_ports {result[13]}]
set_max_transition 0.5 [get_ports {result[12]}]
set_max_transition 0.5 [get_ports {result[11]}]
set_max_transition 0.5 [get_ports {result[10]}]
set_max_transition 0.5 [get_ports {result[9]}]
set_max_transition 0.5 [get_ports {result[8]}]
set_max_transition 0.5 [get_ports {result[7]}]
set_max_transition 0.5 [get_ports {result[6]}]
set_max_transition 0.5 [get_ports {result[5]}]
set_max_transition 0.5 [get_ports {result[4]}]
set_max_transition 0.5 [get_ports {result[3]}]
set_max_transition 0.5 [get_ports {result[2]}]
set_max_transition 0.5 [get_ports {result[1]}]
set_max_transition 0.5 [get_ports {result[0]}]
set_max_capacitance 0.05 [get_ports rstn]
set_max_capacitance 0.05 [get_ports clk]
set_max_capacitance 0.05 [get_ports {multiplicand[31]}]
set_max_capacitance 0.05 [get_ports {multiplicand[30]}]
set_max_capacitance 0.05 [get_ports {multiplicand[29]}]
set_max_capacitance 0.05 [get_ports {multiplicand[28]}]
set_max_capacitance 0.05 [get_ports {multiplicand[27]}]
set_max_capacitance 0.05 [get_ports {multiplicand[26]}]
set_max_capacitance 0.05 [get_ports {multiplicand[25]}]
set_max_capacitance 0.05 [get_ports {multiplicand[24]}]
set_max_capacitance 0.05 [get_ports {multiplicand[23]}]
set_max_capacitance 0.05 [get_ports {multiplicand[22]}]
set_max_capacitance 0.05 [get_ports {multiplicand[21]}]
set_max_capacitance 0.05 [get_ports {multiplicand[20]}]
set_max_capacitance 0.05 [get_ports {multiplicand[19]}]
set_max_capacitance 0.05 [get_ports {multiplicand[18]}]
set_max_capacitance 0.05 [get_ports {multiplicand[17]}]
set_max_capacitance 0.05 [get_ports {multiplicand[16]}]
set_max_capacitance 0.05 [get_ports {multiplicand[15]}]
set_max_capacitance 0.05 [get_ports {multiplicand[14]}]
set_max_capacitance 0.05 [get_ports {multiplicand[13]}]
set_max_capacitance 0.05 [get_ports {multiplicand[12]}]
set_max_capacitance 0.05 [get_ports {multiplicand[11]}]
set_max_capacitance 0.05 [get_ports {multiplicand[10]}]
set_max_capacitance 0.05 [get_ports {multiplicand[9]}]
set_max_capacitance 0.05 [get_ports {multiplicand[8]}]
set_max_capacitance 0.05 [get_ports {multiplicand[7]}]
set_max_capacitance 0.05 [get_ports {multiplicand[6]}]
set_max_capacitance 0.05 [get_ports {multiplicand[5]}]
set_max_capacitance 0.05 [get_ports {multiplicand[4]}]
set_max_capacitance 0.05 [get_ports {multiplicand[3]}]
set_max_capacitance 0.05 [get_ports {multiplicand[2]}]
set_max_capacitance 0.05 [get_ports {multiplicand[1]}]
set_max_capacitance 0.05 [get_ports {multiplicand[0]}]
set_max_capacitance 0.05 [get_ports {multiplier[31]}]
set_max_capacitance 0.05 [get_ports {multiplier[30]}]
set_max_capacitance 0.05 [get_ports {multiplier[29]}]
set_max_capacitance 0.05 [get_ports {multiplier[28]}]
set_max_capacitance 0.05 [get_ports {multiplier[27]}]
set_max_capacitance 0.05 [get_ports {multiplier[26]}]
set_max_capacitance 0.05 [get_ports {multiplier[25]}]
set_max_capacitance 0.05 [get_ports {multiplier[24]}]
set_max_capacitance 0.05 [get_ports {multiplier[23]}]
set_max_capacitance 0.05 [get_ports {multiplier[22]}]
set_max_capacitance 0.05 [get_ports {multiplier[21]}]
set_max_capacitance 0.05 [get_ports {multiplier[20]}]
set_max_capacitance 0.05 [get_ports {multiplier[19]}]
set_max_capacitance 0.05 [get_ports {multiplier[18]}]
set_max_capacitance 0.05 [get_ports {multiplier[17]}]
set_max_capacitance 0.05 [get_ports {multiplier[16]}]
set_max_capacitance 0.05 [get_ports {multiplier[15]}]
set_max_capacitance 0.05 [get_ports {multiplier[14]}]
set_max_capacitance 0.05 [get_ports {multiplier[13]}]
set_max_capacitance 0.05 [get_ports {multiplier[12]}]
set_max_capacitance 0.05 [get_ports {multiplier[11]}]
set_max_capacitance 0.05 [get_ports {multiplier[10]}]
set_max_capacitance 0.05 [get_ports {multiplier[9]}]
set_max_capacitance 0.05 [get_ports {multiplier[8]}]
set_max_capacitance 0.05 [get_ports {multiplier[7]}]
set_max_capacitance 0.05 [get_ports {multiplier[6]}]
set_max_capacitance 0.05 [get_ports {multiplier[5]}]
set_max_capacitance 0.05 [get_ports {multiplier[4]}]
set_max_capacitance 0.05 [get_ports {multiplier[3]}]
set_max_capacitance 0.05 [get_ports {multiplier[2]}]
set_max_capacitance 0.05 [get_ports {multiplier[1]}]
set_max_capacitance 0.05 [get_ports {multiplier[0]}]
set_max_leakage_power 50000.0
set_dont_use [get_lib_cells slow/RF1R1WX2]
set_dont_use [get_lib_cells slow/RF2R1WX2]
set_dont_use [get_lib_cells slow/RFRDX1]
set_dont_use [get_lib_cells slow/RFRDX2]
set_dont_use [get_lib_cells slow/RFRDX4]
set_dont_use [get_lib_cells slow/TIEHI]
set_dont_use [get_lib_cells slow/TIELO]
set_dont_use [get_lib_cells slow/TTLATXL]
set_clock_uncertainty -setup 0.05 [get_clocks clk]
set_clock_uncertainty -hold 0.005 [get_clocks clk]
